# Tutorial 3 - Dummy Variables & One Hot Encoding

In [1]:
import numpy as np
import pandas as pd

In [6]:
df1 = pd.read_csv("3-car-price.csv")
df1

   Car Model  Mileage  Age  Price
0        BMW    69000    6  18000
1        BMW    35000    3  34000
2        BMW    57000    5  26100
3        BMW    22500    2  40000
4        BMW    46000    4  31500
5      Volvo    59000    5  29400
6      Volvo    52000    5  32000
7      Volvo    72000    6  19300
8      Volvo    91000    8  12000
9     Toyota    67000    6  22000
10    Toyota    83000    7  20000
11    Toyota    79000    7  21000
12    Toyota    59000    5  33000

In [26]:
# we can assign `bmw=1`, `volvo=2`, and `toyota=3`

# or we can use one hot encoding, which is to assgin each column 
# with binary numbers either 0 or 1

In [24]:
# In pandas, we use the `get_dummies` function to achieve this.
car_model_dummy_columns = pd.get_dummies(df1["Car Model"]) # or `df1.Age`

In [25]:
print(car_model_dummy_columns)

    BMW  Toyota  Volvo
0     1       0      0
1     1       0      0
2     1       0      0
3     1       0      0
4     1       0      0
5     0       0      1
6     0       0      1
7     0       0      1
8     0       0      1
9     0       1      0
10    0       1      0
11    0       1      0
12    0       1      0

In [27]:
# next we should join the dummy columns to original data set.

df2 = pd.concat([df1, car_model_dummy_columns], axis="columns")
print(df2)

   Car Model  Mileage  Age  Price  BMW  Toyota  Volvo
0        BMW    69000    6  18000    1       0      0
1        BMW    35000    3  34000    1       0      0
2        BMW    57000    5  26100    1       0      0
3        BMW    22500    2  40000    1       0      0
4        BMW    46000    4  31500    1       0      0
5      Volvo    59000    5  29400    0       0      1
6      Volvo    52000    5  32000    0       0      1
7      Volvo    72000    6  19300    0       0      1
8      Volvo    91000    8  12000    0       0      1
9     Toyota    67000    6  22000    0       1      0
10    Toyota    83000    7  20000    0       1      0
11    Toyota    79000    7  21000    0       1      0
12    Toyota    59000    5  33000    0       1      0

In [31]:
# now we don't need the `car model` column
# therefore it can be dropped from the data frame.

df3 = df2.drop(["Car Model"], axis="columns")
print(df3)

    Mileage  Age  Price  BMW  Toyota  Volvo
0     69000    6  18000    1       0      0
1     35000    3  34000    1       0      0
2     57000    5  26100    1       0      0
3     22500    2  40000    1       0      0
4     46000    4  31500    1       0      0
5     59000    5  29400    0       0      1
6     52000    5  32000    0       0      1
7     72000    6  19300    0       0      1
8     91000    8  12000    0       0      1
9     67000    6  22000    0       1      0
10    83000    7  20000    0       1      0
11    79000    7  21000    0       1      0
12    59000    5  33000    0       1      0